msalau/rl78-samples-R5F100SLAFB/common/iodefine_ext.h
union un_drc3 {
    unsigned char drc3;
    struct {
        unsigned char dst3 :1;
        unsigned char :6;
        unsigned char den3 :1;
    } BIT;
};
union un_dwaitall {
    unsigned char dwaitall;
    struct {
        unsigned char dwaitall0 :1;
        unsigned char :6;
        unsigned char prvari :1;
    } BIT;
};
union un_iicctl00 {
    unsigned char iicctl00;
    struct {
        unsigned char spt0 :1;
        unsigned char stt0 :1;
        unsigned char acke0 :1;
        unsigned char wtim0 :1;
        unsigned char spie0 :1;
        unsigned char wrel0 :1;
        unsigned char lrel0 :1;
        unsigned char iice0 :1;
    } BIT;
};
union un_iicctl01 {
    unsigned char iicctl01;
    struct {
        unsigned char prs0 :1;
        unsigned char :1;
        unsigned char dfc0 :1;
        unsigned char smc0 :1;
        unsigned char dad0 :1;
        unsigned char cld0 :1;
        unsigned char :1;
        unsigned char wup0 :1;
    } BIT;
};
union un_iicwl0 {
    unsigned char iicwl0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_iicwh0 {
    unsigned char iicwh0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_sva0 {
    unsigned char sva0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_iicse0 {
    unsigned char iicse0;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_iicctl10 {
    unsigned char iicctl10;
    struct {
        unsigned char spt1 :1;
        unsigned char stt1 :1;
        unsigned char acke1 :1;
        unsigned char wtim1 :1;
        unsigned char spie1 :1;
        unsigned char wrel1 :1;
        unsigned char lrel1 :1;
        unsigned char iice1 :1;
    } BIT;
};
union un_iicctl11 {
    unsigned char iicctl11;
    struct {
        unsigned char prs1 :1;
        unsigned char :1;
        unsigned char dfc1 :1;
        unsigned char smc1 :1;
        unsigned char dad1 :1;
        unsigned char cld1 :1;
        unsigned char :1;
        unsigned char wup1 :1;
    } BIT;
};
union un_iicwl1 {
    unsigned char iicwl1;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_iicwh1 {
    unsigned char iicwh1;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_sva1 {
    unsigned char sva1;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_iicse1 {
    unsigned char iicse1;
    struct {
        unsigned char bit0 :1;
        unsigned char bit1 :1;
        unsigned char bit2 :1;
        unsigned char bit3 :1;
        unsigned char bit4 :1;
        unsigned char bit5 :1;
        unsigned char bit6 :1;
        unsigned char bit7 :1;
    } BIT;
};
union un_crc0ctl {
    unsigned char crc0ctl;
    struct {
        unsigned char :7;
        unsigned char crc0en :1;
    } BIT;
};
union un_pgcrcl {
    unsigned short pgcrcl;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};
union un_crcd {
    unsigned short crcd;
    struct {
        unsigned short bit0 :1;
        unsigned short bit1 :1;
        unsigned short bit2 :1;
        unsigned short bit3 :1;
        unsigned short bit4 :1;
        unsigned short bit5 :1;
        unsigned short bit6 :1;
        unsigned short bit7 :1;
        unsigned short bit8 :1;
        unsigned short bit9 :1;
        unsigned short bit10 :1;
        unsigned short bit11 :1;
        unsigned short bit12 :1;
        unsigned short bit13 :1;
        unsigned short bit14 :1;
        unsigned short bit15 :1;
    } BIT;
};

#define ADM2 (*(volatile union un_adm2 *)0xF0010)
#define ADUL (*(volatile union un_adul *)0xF0011)
#define ADLL (*(volatile union un_adll *)0xF0012)
#define ADTES (*(volatile union un_adtes *)0xF0013)
#define PU0 (*(volatile union un_pu0 *)0xF0030)
#define PU1 (*(volatile union un_pu1 *)0xF0031)
#define PU3 (*(volatile union un_pu3 *)0xF0033)
#define PU4 (*(volatile union un_pu4 *)0xF0034)
#define PU5 (*(volatile union un_pu5 *)0xF0035)
#define PU6 (*(volatile union un_pu6 *)0xF0036)
#define PU7 (*(volatile union un_pu7 *)0xF0037)
#define PU8 (*(volatile union un_pu8 *)0xF0038)
#define PU9 (*(volatile union un_pu9 *)0xF0039)
#define PU10 (*(volatile union un_pu10 *)0xF003A)
#define PU11 (*(volatile union un_pu11 *)0xF003B)
#define PU12 (*(volatile union un_pu12 *)0xF003C)
#define PU14 (*(volatile union un_pu14 *)0xF003E)
#define PIM0 (*(volatile union un_pim0 *)0xF0040)
#define PIM1 (*(volatile union un_pim1 *)0xF0041)
#define PIM4 (*(volatile union un_pim4 *)0xF0044)
#define PIM5 (*(volatile union un_pim5 *)0xF0045)
#define PIM8 (*(volatile union un_pim8 *)0xF0048)
#define PIM14 (*(volatile union un_pim14 *)0xF004E)
#define POM0 (*(volatile union un_pom0 *)0xF0050)
#define POM1 (*(volatile union un_pom1 *)0xF0051)
#define POM4 (*(volatile union un_pom4 *)0xF0054)
#define POM5 (*(volatile union un_pom5 *)0xF0055)
#define POM7 (*(volatile union un_pom7 *)0xF0057)
#define POM8 (*(volatile union un_pom8 *)0xF0058)
#define POM9 (*(volatile union un_pom9 *)0xF0059)
#define POM14 (*(volatile union un_pom14 *)0xF005E)
#define PMC0 (*(volatile union un_pmc0 *)0xF0060)
#define PMC3 (*(volatile union un_pmc3 *)0xF0063)
#define PMC10 (*(volatile union un_pmc10 *)0xF006A)
#define PMC11 (*(volatile union un_pmc11 *)0xF006B)
#define PMC12 (*(volatile union un_pmc12 *)0xF006C)
#define PMC14 (*(volatile union un_pmc14 *)0xF006E)
#define NFEN0 (*(volatile union un_nfen0 *)0xF0070)
#define NFEN1 (*(volatile union un_nfen1 *)0xF0071)
#define NFEN2 (*(volatile union un_nfen2 *)0xF0072)
#define ISC (*(volatile union un_isc *)0xF0073)
#define TIS0 (*(volatile union un_tis0 *)0xF0074)
#define ADPC (*(volatile union un_adpc *)0xF0076)
#define PIOR (*(volatile union un_pior *)0xF0077)
#define IAWCTL (*(volatile union un_iawctl *)0xF0078)
#define GDIDIS (*(volatile union un_gdidis *)0xF007D)
#define PRDSEL (*(volatile union un_prdsel *)0xF007E)
#define TOOLEN (*(volatile union un_toolen *)0xF0080)
#define BPAL0 (*(volatile union un_bpal0 *)0xF0081)
#define BPAH0 (*(volatile union un_bpah0 *)0xF0082)
#define BPAS0 (*(volatile union un_bpas0 *)0xF0083)
#define BACDVL0 (*(volatile union un_bacdvl0 *)0xF0084)
#define BACDVH0 (*(volatile union un_bacdvh0 *)0xF0085)
#define BACDML0 (*(volatile union un_bacdml0 *)0xF0086)
#define BACDMH0 (*(volatile union un_bacdmh0 *)0xF0087)
#define MONMOD (*(volatile union un_monmod *)0xF0088)
#define DFLCTL (*(volatile union un_dflctl *)0xF0090)
#define HIOTRM (*(volatile union un_hiotrm *)0xF00A0)
#define BECTL (*(volatile union un_bectl *)0xF00A1)
#define HOCODIV (*(volatile union un_hocodiv *)0xF00A8)
#define TEMPCAL0 (*(volatile union un_tempcal0 *)0xF00AC)
#define TEMPCAL1 (*(volatile union un_tempcal1 *)0xF00AD)
#define TEMPCAL2 (*(volatile union un_tempcal2 *)0xF00AE)
#define TEMPCAL3 (*(volatile union un_tempcal3 *)0xF00AF)
#define FLSEC (*(volatile union un_flsec *)0xF00B0)
#define FLFSWS (*(volatile union un_flfsws *)0xF00B2)
#define FLFSWE (*(volatile union un_flfswe *)0xF00B4)
#define FSSET (*(volatile union un_fsset *)0xF00B6)
#define FSSE (*(volatile union un_fsse *)0xF00B7)
#define FLFADL (*(volatile union un_flfadl *)0xF00B8)
#define FLFADH (*(volatile union un_flfadh *)0xF00BA)
#define PFCMD (*(volatile union un_pfcmd *)0xF00C0)
#define PFS (*(volatile union un_pfs *)0xF00C1)
#define FLRL (*(volatile union un_flrl *)0xF00C2)
#define FLRH (*(volatile union un_flrh *)0xF00C4)
#define FLWE (*(volatile union un_flwe *)0xF00C6)
#define FLRE (*(volatile union un_flre *)0xF00C7)
#define FLTMS (*(volatile union un_fltms *)0xF00C8)
#define DFLMC (*(volatile union un_dflmc *)0xF00CA)
#define FLMCL (*(volatile union un_flmcl *)0xF00CC)
#define FLMCH (*(volatile union un_flmch *)0xF00CE)
#define FSCTL (*(volatile union un_fsctl *)0xF00CF)
#define ICEADR (*(volatile union un_iceadr *)0xF00D0)
#define ICEDAT (*(volatile union un_icedat *)0xF00D2)
#define MDCL (*(volatile union un_mdcl *)0xF00E0)
#define MDCH (*(volatile union un_mdch *)0xF00E2)
#define MDUC (*(volatile union un_mduc *)0xF00E8)
#define PER0 (*(volatile union un_per0 *)0xF00F0)
#define OSMC (*(volatile union un_osmc *)0xF00F3)
#define RMC (*(volatile union un_rmc *)0xF00F4)
#define RPECTL (*(volatile union un_rpectl *)0xF00F5)
#define BCDADJ (*(volatile union un_bcdadj *)0xF00FE)
#define VECTCTRL (*(volatile union un_vectctrl *)0xF00FF)
#define SSR00 (*(volatile union un_ssr00 *)0xF0100)
#define SSR00L (*(volatile union un_ssr00l *)0xF0100)
#define SSR01 (*(volatile union un_ssr01 *)0xF0102)
#define SSR01L (*(volatile union un_ssr01l *)0xF0102)
#define SSR02 (*(volatile union un_ssr02 *)0xF0104)
#define SSR02L (*(volatile union un_ssr02l *)0xF0104)
#define SSR03 (*(volatile union un_ssr03 *)0xF0106)
#define SSR03L (*(volatile union un_ssr03l *)0xF0106)
#define SIR00 (*(volatile union un_sir00 *)0xF0108)
#define SIR00L (*(volatile union un_sir00l *)0xF0108)
#define SIR01 (*(volatile union un_sir01 *)0xF010A)
#define SIR01L (*(volatile union un_sir01l *)0xF010A)
#define SIR02 (*(volatile union un_sir02 *)0xF010C)
#define SIR02L (*(volatile union un_sir02l *)0xF010C)
#define SIR03 (*(volatile union un_sir03 *)0xF010E)
#define SIR03L (*(volatile union un_sir03l *)0xF010E)
#define SMR00 (*(volatile union un_smr00 *)0xF0110)
#define SMR01 (*(volatile union un_smr01 *)0xF0112)
#define SMR02 (*(volatile union un_smr02 *)0xF0114)
#define SMR03 (*(volatile union un_smr03 *)0xF0116)
#define SCR00 (*(volatile union un_scr00 *)0xF0118)
#define SCR01 (*(volatile union un_scr01 *)0xF011A)
#define SCR02 (*(volatile union un_scr02 *)0xF011C)
#define SCR03 (*(volatile union un_scr03 *)0xF011E)
#define SE0 (*(volatile union un_se0 *)0xF0120)
#define SE0L (*(volatile union un_se0l *)0xF0120)
#define SS0 (*(volatile union un_ss0 *)0xF0122)
#define SS0L (*(volatile union un_ss0l *)0xF0122)
#define ST0 (*(volatile union un_st0 *)0xF0124)
#define ST0L (*(volatile union un_st0l *)0xF0124)
#define SPS0 (*(volatile union un_sps0 *)0xF0126)
#define SPS0L (*(volatile union un_sps0l *)0xF0126)
#define SO0 (*(volatile union un_so0 *)0xF0128)
#define SOE0 (*(volatile union un_soe0 *)0xF012A)
#define SOE0L (*(volatile union un_soe0l *)0xF012A)
#define EDR00 (*(volatile union un_edr00 *)0xF012C)
#define EDR00L (*(volatile union un_edr00l *)0xF012C)
#define EDR01 (*(volatile union un_edr01 *)0xF012E)
#define EDR01L (*(volatile union un_edr01l *)0xF012E)
#define EDR02 (*(volatile union un_edr02 *)0xF0130)
#define EDR02L (*(volatile union un_edr02l *)0xF0130)
#define EDR03 (*(volatile union un_edr03 *)0xF0132)
#define EDR03L (*(volatile union un_edr03l *)0xF0132)
#define SOL0 (*(volatile union un_sol0 *)0xF0134)
#define SOL0L (*(volatile union un_sol0l *)0xF0134)
#define SSC0 (*(volatile union un_ssc0 *)0xF0138)
#define SSC0L (*(volatile union un_ssc0l *)0xF0138)
#define SSR10 (*(volatile union un_ssr10 *)0xF0140)
#define SSR10L (*(volatile union un_ssr10l *)0xF0140)
#define SSR11 (*(volatile union un_ssr11 *)0xF0142)
#define SSR11L (*(volatile union un_ssr11l *)0xF0142)
#define SSR12 (*(volatile union un_ssr12 *)0xF0144)
#define SSR12L (*(volatile union un_ssr12l *)0xF0144)
#define SSR13 (*(volatile union un_ssr13 *)0xF0146)
#define SSR13L (*(volatile union un_ssr13l *)0xF0146)
#define SIR10 (*(volatile union un_sir10 *)0xF0148)
#define SIR10L (*(volatile union un_sir10l *)0xF0148)
#define SIR11 (*(volatile union un_sir11 *)0xF014A)
#define SIR11L (*(volatile union un_sir11l *)0xF014A)
#define SIR12 (*(volatile union un_sir12 *)0xF014C)
#define SIR12L (*(volatile union un_sir12l *)0xF014C)
#define SIR13 (*(volatile union un_sir13 *)0xF014E)
#define SIR13L (*(volatile union un_sir13l *)0xF014E)
#define SMR10 (*(volatile union un_smr10 *)0xF0150)
#define SMR11 (*(volatile union un_smr11 *)0xF0152)
#define SMR12 (*(volatile union un_smr12 *)0xF0154)
#define SMR13 (*(volatile union un_smr13 *)0xF0156)
#define SCR10 (*(volatile union un_scr10 *)0xF0158)
#define SCR11 (*(volatile union un_scr11 *)0xF015A)
#define SCR12 (*(volatile union un_scr12 *)0xF015C)
#define SCR13 (*(volatile union un_scr13 *)0xF015E)
#define SE1 (*(volatile union un_se1 *)0xF0160)
#define SE1L (*(volatile union un_se1l *)0xF0160)
#define SS1 (*(volatile union un_ss1 *)0xF0162)
#define SS1L (*(volatile union un_ss1l *)0xF0162)
#define ST1 (*(volatile union un_st1 *)0xF0164)
#define ST1L (*(volatile union un_st1l *)0xF0164)
#define SPS1 (*(volatile union un_sps1 *)0xF0166)
#define SPS1L (*(volatile union un_sps1l *)0xF0166)
#define SO1 (*(volatile union un_so1 *)0xF0168)
#define SOE1 (*(volatile union un_soe1 *)0xF016A)
#define SOE1L (*(volatile union un_soe1l *)0xF016A)
#define EDR10 (*(volatile union un_edr10 *)0xF016C)
#define EDR10L (*(volatile union un_edr10l *)0xF016C)
#define EDR11 (*(volatile union un_edr11 *)0xF016E)
#define EDR11L (*(volatile union un_edr11l *)0xF016E)
#define EDR12 (*(volatile union un_edr12 *)0xF0170)
#define EDR12L (*(volatile union un_edr12l *)0xF0170)
#define EDR13 (*(volatile union un_edr13 *)0xF0172)
#define EDR13L (*(volatile union un_edr13l *)0xF0172)
#define SOL1 (*(volatile union un_sol1 *)0xF0174)
#define SOL1L (*(volatile union un_sol1l *)0xF0174)
#define SSC1 (*(volatile union un_ssc1 *)0xF0178)
#define SSC1L (*(volatile union un_ssc1l *)0xF0178)
#define TCR00 (*(volatile union un_tcr00 *)0xF0180)
#define TCR01 (*(volatile union un_tcr01 *)0xF0182)
#define TCR02 (*(volatile union un_tcr02 *)0xF0184)
#define TCR03 (*(volatile union un_tcr03 *)0xF0186)
#define TCR04 (*(volatile union un_tcr04 *)0xF0188)
#define TCR05 (*(volatile union un_tcr05 *)0xF018A)
#define TCR06 (*(volatile union un_tcr06 *)0xF018C)
#define TCR07 (*(volatile union un_tcr07 *)0xF018E)
#define TMR00 (*(volatile union un_tmr00 *)0xF0190)
#define TMR01 (*(volatile union un_tmr01 *)0xF0192)
#define TMR02 (*(volatile union un_tmr02 *)0xF0194)
#define TMR03 (*(volatile union un_tmr03 *)0xF0196)
#define TMR04 (*(volatile union un_tmr04 *)0xF0198)
#define TMR05 (*(volatile union un_tmr05 *)0xF019A)
#define TMR06 (*(volatile union un_tmr06 *)0xF019C)
#define TMR07 (*(volatile union un_tmr07 *)0xF019E)
#define TSR00 (*(volatile union un_tsr00 *)0xF01A0)
#define TSR00L (*(volatile union un_tsr00l *)0xF01A0)
#define TSR01 (*(volatile union un_tsr01 *)0xF01A2)
#define TSR01L (*(volatile union un_tsr01l *)0xF01A2)
#define TSR02 (*(volatile union un_tsr02 *)0xF01A4)
#define TSR02L (*(volatile union un_tsr02l *)0xF01A4)
#define TSR03 (*(volatile union un_tsr03 *)0xF01A6)
#define TSR03L (*(volatile union un_tsr03l *)0xF01A6)
#define TSR04 (*(volatile union un_tsr04 *)0xF01A8)
#define TSR04L (*(volatile union un_tsr04l *)0xF01A8)
#define TSR05 (*(volatile union un_tsr05 *)0xF01AA)
#define TSR05L (*(volatile union un_tsr05l *)0xF01AA)
#define TSR06 (*(volatile union un_tsr06 *)0xF01AC)
#define TSR06L (*(volatile union un_tsr06l *)0xF01AC)
#define TSR07 (*(volatile union un_tsr07 *)0xF01AE)
#define TSR07L (*(volatile union un_tsr07l *)0xF01AE)
#define TE0 (*(volatile union un_te0 *)0xF01B0)
#define TE0L (*(volatile union un_te0l *)0xF01B0)
#define TS0 (*(volatile union un_ts0 *)0xF01B2)
#define TS0L (*(volatile union un_ts0l *)0xF01B2)
#define TT0 (*(volatile union un_tt0 *)0xF01B4)
#define TT0L (*(volatile union un_tt0l *)0xF01B4)
#define TPS0 (*(volatile union un_tps0 *)0xF01B6)
#define TO0 (*(volatile union un_to0 *)0xF01B8)
#define TO0L (*(volatile union un_to0l *)0xF01B8)
#define TOE0 (*(volatile union un_toe0 *)0xF01BA)
#define TOE0L (*(volatile union un_toe0l *)0xF01BA)
#define TOL0 (*(volatile union un_tol0 *)0xF01BC)
#define TOL0L (*(volatile union un_tol0l *)0xF01BC)
#define TOM0 (*(volatile union un_tom0 *)0xF01BE)
#define TOM0L (*(volatile union un_tom0l *)0xF01BE)
#define TCR10 (*(volatile union un_tcr10 *)0xF01C0)
#define TCR11 (*(volatile union un_tcr11 *)0xF01C2)
#define TCR12 (*(volatile union un_tcr12 *)0xF01C4)
#define TCR13 (*(volatile union un_tcr13 *)0xF01C6)
#define TCR14 (*(volatile union un_tcr14 *)0xF01C8)
#define TCR15 (*(volatile union un_tcr15 *)0xF01CA)
#define TCR16 (*(volatile union un_tcr16 *)0xF01CC)
#define TCR17 (*(volatile union un_tcr17 *)0xF01CE)
#define TMR10 (*(volatile union un_tmr10 *)0xF01D0)
#define TMR11 (*(volatile union un_tmr11 *)0xF01D2)
#define TMR12 (*(volatile union un_tmr12 *)0xF01D4)
#define TMR13 (*(volatile union un_tmr13 *)0xF01D6)
#define TMR14 (*(volatile union un_tmr14 *)0xF01D8)
#define TMR15 (*(volatile union un_tmr15 *)0xF01DA)
#define TMR16 (*(volatile union un_tmr16 *)0xF01DC)
#define TMR17 (*(volatile union un_tmr17 *)0xF01DE)
#define TSR10 (*(volatile union un_tsr10 *)0xF01E0)
#define TSR10L (*(volatile union un_tsr10l *)0xF01E0)
#define TSR11 (*(volatile union un_tsr11 *)0xF01E2)
#define TSR11L (*(volatile union un_tsr11l *)0xF01E2)
#define TSR12 (*(volatile union un_tsr12 *)0xF01E4)
#define TSR12L (*(volatile union un_tsr12l *)0xF01E4)
#define TSR13 (*(volatile union un_tsr13 *)0xF01E6)
#define TSR13L (*(volatile union un_tsr13l *)0xF01E6)
#define TSR14 (*(volatile union un_tsr14 *)0xF01E8)
#define TSR14L (*(volatile union un_tsr14l *)0xF01E8)
#define TSR15 (*(volatile union un_tsr15 *)0xF01EA)
#define TSR15L (*(volatile union un_tsr15l *)0xF01EA)
#define TSR16 (*(volatile union un_tsr16 *)0xF01EC)
#define TSR16L (*(volatile union un_tsr16l *)0xF01EC)
#define TSR17 (*(volatile union un_tsr17 *)0xF01EE)
#define TSR17L (*(volatile union un_tsr17l *)0xF01EE)
#define TE1 (*(volatile union un_te1 *)0xF01F0)
#define TE1L (*(volatile union un_te1l *)0xF01F0)
#define TS1 (*(volatile union un_ts1 *)0xF01F2)
#define TS1L (*(volatile union un_ts1l *)0xF01F2)
#define TT1 (*(volatile union un_tt1 *)0xF01F4)
#define TT1L (*(volatile union un_tt1l *)0xF01F4)
#define TPS1 (*(volatile union un_tps1 *)0xF01F6)
#define TO1 (*(volatile union un_to1 *)0xF01F8)
#define TO1L (*(volatile union un_to1l *)0xF01F8)
#define TOE1 (*(volatile union un_toe1 *)0xF01FA)
#define TOE1L (*(volatile union un_toe1l *)0xF01FA)
#define TOL1 (*(volatile union un_tol1 *)0xF01FC)
#define TOL1L (*(volatile union un_tol1l *)0xF01FC)
#define TOM1 (*(volatile union un_tom1 *)0xF01FE)
#define TOM1L (*(volatile union un_tom1l *)0xF01FE)
#define DSA2 (*(volatile union un_dsa2 *)0xF0200)
#define DSA3 (*(volatile union un_dsa3 *)0xF0201)
#define DRA2 (*(volatile union un_dra2 *)0xF0202)
#define DRA2L (*(volatile union un_dra2l *)0xF0202)
#define DRA2H (*(volatile union un_dra2h *)0xF0203)
#define DRA3 (*(volatile union un_dra3 *)0xF0204)
#define DRA3L (*(volatile union un_dra3l *)0xF0204)
#define DRA3H (*(volatile union un_dra3h *)0xF0205)
#define DBC2 (*(volatile union un_dbc2 *)0xF0206)
#define DBC2L (*(volatile union un_dbc2l *)0xF0206)
#define DBC2H (*(volatile union un_dbc2h *)0xF0207)
#define DBC3 (*(volatile union un_dbc3 *)0xF0208)
#define DBC3L (*(volatile union un_dbc3l *)0xF0208)
#define DBC3H (*(volatile union un_dbc3h *)0xF0209)
#define DMC2 (*(volatile union un_dmc2 *)0xF020A)
#define DMC3 (*(volatile union un_dmc3 *)0xF020B)
#define DRC2 (*(volatile union un_drc2 *)0xF020C)
#define DRC3 (*(volatile union un_drc3 *)0xF020D)
#define DWAITALL (*(volatile union un_dwaitall *)0xF020F)
#define IICCTL00 (*(volatile union un_iicctl00 *)0xF0230)
#define IICCTL01 (*(volatile union un_iicctl01 *)0xF0231)
#define IICWL0 (*(volatile union un_iicwl0 *)0xF0232)
#define IICWH0 (*(volatile union un_iicwh0 *)0xF0233)
#define SVA0 (*(volatile union un_sva0 *)0xF0234)
#define IICSE0 (*(volatile union un_iicse0 *)0xF0235)
#define IICCTL10 (*(volatile union un_iicctl10 *)0xF0238)
#define IICCTL11 (*(volatile union un_iicctl11 *)0xF0239)
#define IICWL1 (*(volatile union un_iicwl1 *)0xF023A)
#define IICWH1 (*(volatile union un_iicwh1 *)0xF023B)
#define SVA1 (*(volatile union un_sva1 *)0xF023C)
#define IICSE1 (*(volatile union un_iicse1 *)0xF023D)
#define CRC0CTL (*(volatile union un_crc0ctl *)0xF02F0)
#define PGCRCL (*(volatile union un_pgcrcl *)0xF02F2)
#define CRCD (*(volatile union un_crcd *)0xF02FA)

