msalau/rl78-samples-R5F100SLAFB/common/iodefine_ext.h
/*
 Sfr bits
 */
#define ADTYP ADM2.BIT.adtyp
#define AWC ADM2.BIT.awc
#define ADRCK ADM2.BIT.adrck
#define DFLEN DFLCTL.BIT.dflen
#define BRSAM BECTL.BIT.brsam
#define ESQST FSSE.BIT.esqst
#define DIVST MDUC.BIT.divst
#define MACSF MDUC.BIT.macsf
#define MACOF MDUC.BIT.macof
#define MDSM MDUC.BIT.mdsm
#define MACMODE MDUC.BIT.macmode
#define DIVMODE MDUC.BIT.divmode
#define TAU0EN PER0.BIT.tau0en
#define TAU1EN PER0.BIT.tau1en
#define SAU0EN PER0.BIT.sau0en
#define SAU1EN PER0.BIT.sau1en
#define IICA0EN PER0.BIT.iica0en
#define ADCEN PER0.BIT.adcen
#define IICA1EN PER0.BIT.iica1en
#define RTCEN PER0.BIT.rtcen
#define PAENB RMC.BIT.paenb
#define WDVOL RMC.BIT.wdvol
#define RPEF RPECTL.BIT.rpef
#define RPERDIS RPECTL.BIT.rperdis
#define DWAIT2 DMC2.BIT.dwait2
#define DS2 DMC2.BIT.ds2
#define DRS2 DMC2.BIT.drs2
#define STG2 DMC2.BIT.stg2
#define DWAIT3 DMC3.BIT.dwait3
#define DS3 DMC3.BIT.ds3
#define DRS3 DMC3.BIT.drs3
#define STG3 DMC3.BIT.stg3
#define DST2 DRC2.BIT.dst2
#define DEN2 DRC2.BIT.den2
#define DST3 DRC3.BIT.dst3
#define DEN3 DRC3.BIT.den3
#define DWAITALL0 DWAITALL.BIT.dwaitall0
#define PRVARI DWAITALL.BIT.prvari
#define SPT0 IICCTL00.BIT.spt0
#define STT0 IICCTL00.BIT.stt0
#define ACKE0 IICCTL00.BIT.acke0
#define WTIM0 IICCTL00.BIT.wtim0
#define SPIE0 IICCTL00.BIT.spie0
#define WREL0 IICCTL00.BIT.wrel0
#define LREL0 IICCTL00.BIT.lrel0
#define IICE0 IICCTL00.BIT.iice0
#define PRS0 IICCTL01.BIT.prs0
#define DFC0 IICCTL01.BIT.dfc0
#define SMC0 IICCTL01.BIT.smc0
#define DAD0 IICCTL01.BIT.dad0
#define CLD0 IICCTL01.BIT.cld0
#define WUP0 IICCTL01.BIT.wup0
#define SPT1 IICCTL10.BIT.spt1
#define STT1 IICCTL10.BIT.stt1
#define ACKE1 IICCTL10.BIT.acke1
#define WTIM1 IICCTL10.BIT.wtim1
#define SPIE1 IICCTL10.BIT.spie1
#define WREL1 IICCTL10.BIT.wrel1
#define LREL1 IICCTL10.BIT.lrel1
#define IICE1 IICCTL10.BIT.iice1
#define PRS1 IICCTL11.BIT.prs1
#define DFC1 IICCTL11.BIT.dfc1
#define SMC1 IICCTL11.BIT.smc1
#define DAD1 IICCTL11.BIT.dad1
#define CLD1 IICCTL11.BIT.cld1
#define WUP1 IICCTL11.BIT.wup1
#define CRC0EN CRC0CTL.BIT.crc0en

/*
 Interrupt vector addresses
 */
#endif
